In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
import numpy as np

In [8]:
df1 = pd.read_csv('Marks.csv')
df2 = pd.read_csv('students.csv')

In [9]:
type(df1)

pandas.core.frame.DataFrame

In [23]:
df_col = pd.merge(df1,df2,on='USN')

In [27]:
df_col

             USN MATHS DAA        Name Section
0  PES1201700038     A   B     Apoorve       F
1  PES1201700148     B   A       Dalal       G
2  PES1201700112     S   C      Aditya       F
3  PES1201701241     A   B      Piyush       A
4  PES1201700003     C   A      Ashwin       E
5  PES1201700056     A   D     Saransh       B
6  PES1201700040     A   C    Kaustubh       D
7  PES1201701424     B   C       Anush       C
8  PES1201701999     D   F  Maheshwari       H

In [25]:
df_col2 = df_col[['USN','Name','Section','MATHS','DAA']]

In [26]:
df_col2

             USN        Name Section MATHS DAA
0  PES1201700038     Apoorve       F     A   B
1  PES1201700148       Dalal       G     B   A
2  PES1201700112      Aditya       F     S   C
3  PES1201701241      Piyush       A     A   B
4  PES1201700003      Ashwin       E     C   A
5  PES1201700056     Saransh       B     A   D
6  PES1201700040    Kaustubh       D     A   C
7  PES1201701424       Anush       C     B   C
8  PES1201701999  Maheshwari       H     D   F